import matplotlib.pyplot as plt
import numpy as np

K = 67.09  ##коэффициент теплопередачи
L=7.62 ## длинна испарителя (м)
N=2800 ## число трубок в испарителе
pi=3.14 ## число Пи
Dn=0.05 ## диаметр трубки(м)
tol=0.004 ## толщина трубки(м)
V=132.295 ## объем котловой воды в барабане(м3)
C = [1493.414, 1479.062, 1463.458, 1447.136, 1429.038, 1410.506, 1393.684,
     1376.796]  ## удельная теплоемкость газов в зависимости от температуры
G = 70.3  ##расход газа на теплообменник (м3/с)
T = 524.15  ##температура воды в межтрубном пространстве (К)
T_n = 1273.15 ##входная температура газов (К)
T_vuh=0 ##выходная температура газов (К)
n=int(input("введите число шагов для расчета"))

F=(pi*Dn*L*N)/n ## расчет площади нагрева

lyambda=(1650.6,1711.9,n) ##теплота парообразования
Gvod=0.063 ## расход воды
VodC=4763 ##удеьная теплоемкасть воды
RoVod=799.2 ## плотность воды
Mvod= 10573 ## масса воды
Cvod=VodC*RoVod ## объемная теплоемкасть воды

C_calc = C[0]
res = []
Qres=[]
i = 1
while i<= n:
    Qv = G * C_calc * T_n
    Q_pot = K * (T_n - T) * F
    Q_v = Qv - Q_pot
    T_vuh = Q_v / (C_calc * G) ## ищем выходную температуру
    res.append([T_vuh])
    Qres.append({Qv,Q_pot})
    print(f"Qv={Qv}, Q_pot={Q_pot}, Q_v={Q_v}, T_vuh={T_vuh}")
    T_n = T_vuh
    if 1223.15<=T_vuh<1273.15:
        C_calc=C[0]
    elif 1123.15<=T_vuh<1223.15:
        C_calc=C[1]
    elif 1023.15<=T_vuh<1123.15:
        C_calc=C[2]
    elif 923.15<T_vuh<1023.15:
        C_calc=C[3]
    elif 823.15<T_vuh<923.15:
        C_calc=C[4]
    elif 723.15<=T_vuh<823.15:
        C_calc=C[5]
    elif 623.15<=T_vuh<723.15:
        C_calc=C[6]
    elif 573.15<=T_vuh<623.15:
        C_calc=C[7]
    i += 1
qvhod=T*Cvod*Gvod
fig, ax = plt.subplots()
x=range(n)
y=res
plt.plot(x, y, 'ro-')
plt.xlabel(u'число шагов')
plt.ylabel(u'температура')
plt.title(u'изменение температуры')
plt.show()
print(Qres)
print(res[-1] )